DataProcessors/УправлениеЛицензированием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>УправлениеЛицензированием</Name>
			<Comment>Управление лицензированием</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Comment>Описание ошибки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Comment>Код ошибки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСтарта</Name>
					<Comment>Режим старта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинКод</Name>
					<Comment>Пин-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СигнатураОборудования</Name>
					<Comment>Сигнатура оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОборудования</Name>
					<Comment>Описание оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАктивации</Name>
					<Comment>Вариант активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Comment>Электронная почта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветИнтернетАктивации</Name>
					<Comment>Ответ интернет активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОтвет</Name>
					<Comment>Переключатель запрос или ответ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокЗапросаТелефоннойАктивации</Name>
					<Comment>Строка запроса телефонной активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>58</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации1</Name>
					<Comment>Блок ответа телефонной активации 1</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации2</Name>
					<Comment>Блок ответа телефонной активации 2</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации3</Name>
					<Comment>Блок ответа телефонной активации 3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключитьсяКВыбранномуСерверуПослеАктивации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерПакетаЛицензий</Name>
					<Comment>Регистрационный номер пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПакетаЛицензий</Name>
					<Comment>Пароль пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАктивации</Name>
					<Comment>Способ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКлюча</Name>
					<Comment>Номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомерКлюча</Name>
					<Comment>Заводской номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установщик</Name>
					<Comment>Установщик</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступаКлючаЗащиты</Name>
					<Comment>Код доступа ключа защиты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/УправлениеЛицензированием/Forms/ФормаНастройкиСервераЗащиты/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.АдресСервера = ЛицензированиеСервер.АдресСервераЛицензирования();
	Объект.КодДоступаКлючаЗащиты = ЛицензированиеСервер.КодДоступаКлючаЗащиты();
	
	// проверка доступности локальной системы лицензирования
	Результат = ЛицензированиеСервер.ЛокальнаяСистемаЛицензированияДоступна(ОписаниеОшибки);
	Если Результат = Неопределено Тогда
		Сообщить(ОписаниеОшибки);
		// И считаем, что недоступна
		ЛокальнаяСистемаЛицензированияДоступна = Ложь;
	Иначе
		ЛокальнаяСистемаЛицензированияДоступна = Результат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.АдресСервера) ИЛИ ВРег(Объект.АдресСервера) = "*LOCAL" Тогда
		Объект.РежимСтарта = 0;
	ИначеЕсли ВРег(Объект.АдресСервера) = "*AUTO" Тогда
		Объект.РежимСтарта = 1;
		Элементы.КодДоступаКлючаЗащиты.Доступность = Ложь;
		Объект.КодДоступаКлючаЗащиты = "";
	Иначе
		Объект.РежимСтарта = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СисИнфо = Новый СистемнаяИнформация;
	ЭтоWindows = СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64;

	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Если ЭтоWindows Тогда
		ПереходКСтранице(Элементы.СтраницаВыборРежима);
		Элементы.СтраницаУказатьАдрес.ПодчиненныеЭлементы.КодДоступаКлючаЗащитыСтраницаАдреса.Видимость = Ложь;
	Иначе
		ПереходКСтранице(Элементы.СтраницаУказатьАдрес);
		Элементы.СтраницаУказатьАдрес.ПодчиненныеЭлементы.КодДоступаКлючаЗащитыСтраницаАдреса.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры


/////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура КомандаВперед(Команда)
	ОбработкаДействия("Вперед");
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	ОбработкаДействия("Назад");
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайтиСервера(Команда)
	СписокСерверов = ЛицензированиеСервер.ПолучитьСписокСерверов(ОписаниеОшибки);
	ВыбранныйЭлемент = СписокСерверов.ВыбратьЭлемент();
	Объект.АдресСервера = ?(ВыбранныйЭлемент = Неопределено, Объект.АдресСервера, ВыбранныйЭлемент.Значение);
КонецПроцедуры

// Обработка действия пользователя
&НаКлиенте
Процедура ОбработкаДействия(Действие)
	Страницы = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы;
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Страницы.СтраницаВыборРежима Тогда
		Если Объект.РежимСтарта = 0 Тогда //LOCAL
			
			Если НЕ ЛокальнаяСистемаЛицензированияДоступна Тогда
				Предупреждение("Недоступен сервер лицензирования на локальном компьютере!
				|Необходимо запустить или выполнить установку сервера лицензирования.");
				Возврат;
			КонецЕсли;	
			Элементы.ДекорацияИзменениеСервера.Заголовок = "Будет выполнено подключение к локальному серверу лицензирования."; 
			Объект.АдресСервера = "*LOCAL";											   
			ПереходКСтранице(Элементы.СтраницаПредупреждение);											   
		
		ИначеЕсли Объект.РежимСтарта = 1 Тогда //AUTO
		
			Элементы.ДекорацияИзменениеСервера.Заголовок = "Будет выполнен поиск сервера лицензирования в сети и подключение к найденному серверу";
			Объект.АдресСервера = "*AUTO";                                               
			ПереходКСтранице(Элементы.СтраницаПредупреждение);												
		
		ИначеЕсли Объект.РежимСтарта = 2 Тогда //Адрес
			
			Объект.АдресСервера = АдресСервераИзПараметраСеанса(); //Текущий сервер лицензирования
			ПереходКСтранице(Страницы.СтраницаУказатьАдрес);
			
		КонецЕсли;
			
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаУказатьАдрес Тогда
		Если Действие = "Вперед" Тогда
			Если ПустаяСтрока(Объект.АдресСервера) Тогда
				Сообщить("Укажите адрес сервера лицензирования");
				Возврат;
			КонецЕсли;
			
			Элементы.ДекорацияИзменениеСервера.Заголовок = "Будет выполнено подключение к серверу лицензирования """ + Объект.АдресСервера + """ ";
															
			ПереходКСтранице(Элементы.СтраницаПредупреждение);												
															
		Иначе //Назад
			ПереходКСтранице(Страницы.СтраницаВыборРежима);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаПредупреждение Тогда
		
		Если Действие = "Вперед" Тогда
			ЛицензированиеСервер.УстановитьАдресСервераЛицензирования(Объект.АдресСервера);
			ЛицензированиеСервер.УстановитьКодДоступаКлючаЗащиты(Объект.КодДоступаКлючаЗащиты);
			Оповестить("СерверЛицензирования",Объект.АдресСервера);
			Закрыть("");
		Иначе
			Если Объект.РежимСтарта = 2 Тогда
				ПереходКСтранице(Страницы.СтраницаУказатьАдрес);
			Иначе
				ПереходКСтранице(Страницы.СтраницаВыборРежима);
			КонецЕсли;
		КонецЕсли;
	Иначе
	КонецЕсли;
		
КонецПроцедуры

// Переход к странице формы
// Параметры
//   Страница - ГруппаФормы - страница, на которую будет осуществлён переход
&НаКлиенте
Процедура ПереходКСтранице(Страница)
	Для Каждого ТекСтраница Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
		ТекСтраница.Видимость = Ложь;
	КонецЦикла;
	Страница.Видимость = Истина;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
	
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	Если  ТекущаяСтраница = Элементы.СтраницаВыборРежима Тогда
		Элементы.ФормаКомандаНазад.Доступность = Ложь;
	Иначе
		Элементы.ФормаКомандаНазад.Доступность = Истина;
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаУказатьАдрес И НЕ ЭтоWindows Тогда
		Элементы.ФормаКомандаНазад.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    СписокСерверов = СписокСерверов(ОписаниеОшибки);
	
	ВыбранныйЭлемент = СписокСерверов.ВыбратьЭлемент("Выберите сервер лицензирования");
	Объект.АдресСервера = ?(ВыбранныйЭлемент = Неопределено, Объект.АдресСервера, ВыбранныйЭлемент.Значение);
КонецПроцедуры

//Возвращает список серверов лицензирования, найденных в локальной сети  
&НаСервереБезКонтекста
Функция СписокСерверов(ОписаниеОшибки)
	Возврат ЛицензированиеСервер.ПолучитьСписокСерверов("", ОписаниеОшибки);
КонецФункции

&НаСервереБезКонтекста
Функция АдресСервераИзПараметраСеанса()
	Возврат ПараметрыСеанса.АдресСервераЛицензирования;
КонецФункции

&НаКлиенте
Процедура РежимСтартаПриИзменении(Элемент)
	Если Объект.РежимСтарта = 1 Тогда
		Объект.КодДоступаКлючаЗащиты = "";
		Элементы.КодДоступаКлючаЗащиты.Доступность = Ложь;
	Иначе
		Элементы.КодДоступаКлючаЗащиты.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры
